In [2]:
import pandas as pd

In [3]:
#data sets

data1={"Id":["S01","S02","S03","S04","S05","S06"],
       "Student":["Mukund","Sachin","Rajesh","Girish","Mohan","Amit"],
       "Roll_No":[101,102,103,104,105,106]
      }
data2={
    "Id":["S07","S08","S09","S10"],
    "Student":["Anita","Pooja","Karishma","Aishwarya"],
    "Roll_No":[107,108,109,110]
}

In [5]:
s1=pd.DataFrame(data1)
s2=pd.DataFrame(data2)

In [6]:
s1

    Id Student  Roll_No
0  S01  Mukund      101
1  S02  Sachin      102
2  S03  Rajesh      103
3  S04  Girish      104
4  S05   Mohan      105
5  S06    Amit      106

In [7]:
s2

    Id    Student  Roll_No
0  S07      Anita      107
1  S08      Pooja      108
2  S09   Karishma      109
3  S10  Aishwarya      110

In [8]:
s1["Student"]

0    Mukund
1    Sachin
2    Rajesh
3    Girish
4     Mohan
5      Amit
Name: Student, dtype: object

In [12]:
s2[["Student","Roll_No"]]

     Student  Roll_No
0      Anita      107
1      Pooja      108
2   Karishma      109
3  Aishwarya      110

In [13]:
s1[["Student","Roll_No"]]

  Student  Roll_No
0  Mukund      101
1  Sachin      102
2  Rajesh      103
3  Girish      104
4   Mohan      105
5    Amit      106

In [14]:
s1.columns[0:2]

Index(['Id', 'Student'], dtype='object')

In [15]:

data3={"Id":["S01","S02","S03","S04","S05","S06"],
       "Student":["Mukund","Sachin","Rajesh","Girish","Mohan","Amit"],
       "Roll_No":[101,102,103,104,105,106],
       "Address":["Germany","Banglore","pune","vadi","vishrantwadi","Khadki"],
       "Gender":["Male","Male","Male","Male","Male","Male"]
      }

In [16]:
data3

{'Id': ['S01', 'S02', 'S03', 'S04', 'S05', 'S06'],
 'Student': ['Mukund', 'Sachin', 'Rajesh', 'Girish', 'Mohan', 'Amit'],
 'Roll_No': [101, 102, 103, 104, 105, 106],
 'Address': ['Germany', 'Banglore', 'pune', 'vadi', 'vishrantwadi', 'Khadki'],
 'Gender': ['Male', 'Male', 'Male', 'Male', 'Male', 'Male']}

In [17]:
df4=pd.DataFrame(data3)

In [18]:
df4

    Id Student  Roll_No       Address Gender
0  S01  Mukund      101       Germany   Male
1  S02  Sachin      102      Banglore   Male
2  S03  Rajesh      103          pune   Male
3  S04  Girish      104          vadi   Male
4  S05   Mohan      105  vishrantwadi   Male
5  S06    Amit      106        Khadki   Male

In [27]:
df4[df4.columns[1:4]]

  Student  Roll_No       Address
0  Mukund      101       Germany
1  Sachin      102      Banglore
2  Rajesh      103          pune
3  Girish      104          vadi
4   Mohan      105  vishrantwadi
5    Amit      106        Khadki

In [32]:
df4.insert(loc=1 , column="Dept" ,value=["comp sci","comp sci","comp sci","comp sci","comp sci","comp sci"])

####

In [33]:
df4

    Id      Dept Student  Roll_No       Address Gender
0  S01  comp sci  Mukund      101       Germany   Male
1  S02  comp sci  Sachin      102      Banglore   Male
2  S03  comp sci  Rajesh      103          pune   Male
3  S04  comp sci  Girish      104          vadi   Male
4  S05  comp sci   Mohan      105  vishrantwadi   Male
5  S06  comp sci    Amit      106        Khadki   Male